#使用字典生成v家角色简介
vocaloid_singers = {}
vocaloid_singers["初音未来"] = '''初音未来（初音ミク/Hatsune Miku），是2007年8月31日由CRYPTON FUTURE MEDIA以Yamaha的VOCALOID系列语音合成程序为基础开发的音源库，
音源数据资料采样于日本声优藤田咲。
2010年4月30日，发布初音未来6种不同声调的版本“初音未来Append”。2013年8月31日，初音未来英文版本同VOCALOID3一并发行。
[1]此外，初音未来还担任日本音乐团体Sound Horizon的演唱与合唱。随着“初音未来”声库的发售，这种成功的营销方式大幅改变了电子音乐人对于音乐业的认知和整个行业的格局。
在衍生文化现象后，初音未来可指代包装封面上的那位葱色头发的少女形象，还可指活跃在动画漫画中出现的“人气歌手”。
近年来，初音未来成为各大厂商的“宠儿”，代言、授权产品种类从互联网、时装、汽车到生活用品，世界各地都有其踪迹。
中文名
初音未来
外文名
Hatsune Miku
初音ミク（はつね　みく）
其他名称
初音，米库（miku），葱娘，公主殿下
配音
藤田咲
登场作品
初音未来歌姬计划系列
生日
2007年8月31日（发售日）
年龄
16岁
性别
女
身高
158cm
体重
42kg
拟物
大葱
主程序
Vocaloid
开发商
Crypton Future Media
语言
日语，英语，汉语
代表作品
甩葱歌、世界第一的公主殿下
国籍
日本
出生地
北海道札幌
擅长曲种
流行歌曲
擅长节奏
70～150BPM（原设80～150）
擅长音域
A3～E5（原设定为C3～E4）'''
vocaloid_singers['meiko'] = '''CRYPTON FUTURE MEDIA（下略作“CRYPTON”）以Yamaha的VOCALOID语音合成引擎为基础开发贩售的虚拟女性歌手软件第一作；
或此软件的印象角色（这只是软件的象征，不会在实际使用时出现）。
于2004年11月发售，开放价格，官方估计系列软件实际价格约19,950日圆。由拜乡芽衣子（拝郷メイコ）提供原声[1]，软件名称也是取自拜乡芽衣子的名称芽衣子（メイコ）。
日语第一套VOCALOID的产品，擅长流行曲、摇滚乐、爵士乐、R&B、童谣等广范围歌种。
中文名
鸣子
外文名
MEIKO
年龄
20岁
生日
11月5日
声源
拝郷メイコ（拜乡芽衣子）
登场作品
VOCALOID
工作引擎
VOCALOID
开发商
Crypton Future Media'''
vocaloid_singers["镜音铃"] = '''镜音铃的特征是活力四射、俏丽动人的青春期少女的歌声、戴有大蝴蝶结的金发波波头、和以印有高音谱号的校服为主题的服装，她是电子歌手软件的一个角色。
她以配音演员下田麻美(Shimoda Asami)的声音为原型创作而成。'''
vocaloid_singers['镜音连'] = '''镜音连的特征是铿锵有力的青春期少年的歌声、从后方短短地束起来的金发、和以印有低音谱号的校服为主题的服装，他是电子歌手软件的一个角色。
他以配音演员下田麻美(Shimoda Asami)的声音为原型创作而成。'''
vocaloid_singers['巡音流歌'] = '''巡音ルカ（巡音露卡、巡音流歌、巡音流香、Megurine Luka）是CRYPTON FUTURE MEDIA（略作“CRYPTON”）以Yamaha的VOCALOID 3语音合成引擎为基础开发贩售的虚拟女性歌手软件角色主唱系列的第三作，
是VOCALOID家族中耳熟能详的一位。
中文名
巡音流歌、巡音露卡
外文名
巡音ルカ
めぐりね ルカ
Megurine Luka
其他名称
Luka女王、世界第一女王殿下
生日
2009年1月30日
年龄
官方设定20岁
性别
女
身高
162cm
体重
45kg
声源
浅川悠
身份
Vocaloid软件角色主唱
开发商
Crypton
编号
cv03
最新版本
巡音ルカV4X
代表物
章鱼、鲔鱼
国籍
日本
代表色
粉色 #FFBFCB rgb(255,192,203)
角色设定
中文名：巡音流歌（巡音露卡、巡音流香）
日文名：巡音ルカ
假名 ：めぐりね ルカ
英文名：Megurine Luka'''
vocaloid_singers['神威乐步'] = '''神威がくぽ（Gakupo）是INTERNET社以Yamaha的VOCALOID2语音合成引擎为基础开发的虚拟男性歌手软件，
音源库（暨该程序的数据包）数据资料来自于日本歌手Gackt（神威乐斗）。
がくぽ是名，来源于由Gackt自己命名的软件名称“がくっぽいど（Gackpoid）” ，意为像GACKT（歌手）的VOCALOID ，神威是姓，中文译名为神威乐步。[1]
角色代表物为茄子，因此Fans昵称其为茄子，茄君，不少人也误称他为“神威茄子”。但茄君原名仍然是神威 がくぽ，在正式场合还是请大家写对他的真名神威 がくぽ（神威乐步）。
神威がくぽ与KAITO(カイト) 、冰山Kiyoteru(氷山キヨテル) 、镜音连（镜音レン)合称V家四美男。
中文名
神威乐步
外文名
神威 がくぽ（Gakupo）
诞生日
2008/4/1
发售日
2008/7/31
昵称
茄子，殿下，神威大人，乐步
代表物
茄子
形象设计
漫画家三浦健太郎
声源
Gackt（神威乐斗）
音域
A1～C4
类型
音乐合成器应用程序
类别
音源库（数据包）
主程序
Vocaloid
销售代理
INTERNET株式会社（I社）
市场参考价值
￥18,900円
诞生日
2008年4月1日
发行日
2008年7月31日
亚种
神威乐子（茄姬）'''
vocaloid_singers['gumi'] = '''Megpoid（メグッポイド）又称作GUMI(グミ)，
是2009年6月26日Internet(株式会社インターネット)以Yamaha的VOCALOID系列语音合成程序为基础开发的虚拟女性歌手软件。音源为中岛爱。
与以“初音ミク”这样闻名的Crypton的产品不同，Internet的产品着重于“重现真实歌手的歌声”。
在歌曲创作已有一定人气，普遍给人印象总是能看到唱着与恋爱相关的曲子。近年在NICO超会议宣传广告担当开头「に～っこにこ动画♪」台词。
中文名
茱萸
外文名
Megpoid
メグッポイド
其他名称
GUMI(グミ)、咕咪
配音
中岛爱
登场作品
Megpoid the Music♯
うたシュー! with メグッポイド
生日
2009年6月26日
年龄
未設定[1]
性别
女
血型
未設定
身高
未設定
体重
未設定
开发商
Internet
类型
音乐合成器应用程序
属于
音源库（数据包）
主程序
Vocaloid
语言
日语/英语
推荐音域
F2～A4
推荐節奏
60BPM～175BPM
价格
15750日元
星座
巨蟹座
代表作品
马赛克卷、天之弱
象征物
胡萝卜'''
vocaloid_singers['歌爱雪'] = '''
歌爱雪是一款VOCALOID虚拟歌手，是YAMAHA株式会社研发的技术，也可指使用这个技术的音声合成软件。
其本身需要声音库才能合成即没有声音库，其就不能使用。YAMAHA研发的这个技术，让其他公司去加入声音库后进行开发，然后制成软件的成品。
VOCALOID软件采用Yamaha开发的「Frequency-domain Singing Articulation Splicing and Shaping」。
先采集人类声音的标本，然后再制作歌声资料库。但VOCALOID没有歌声资料库，实际可使用的版本由其他公司开发。
曾经开发过一款著名的可以让图片开口说话的软件“Crazy Talk”的AHS公司将在12月4日发售3款全新的基于Vocaloid2制作的人声音源软件，
3名角色分别是小学生「歌爱ユキ」、老师「冰山キヨテル」以及「SF-A2 开発コード miki」，他们将成为Vocaloid家族的新成员，为大家带来更多美妙的歌曲'''
vocaloid_singers['IA'] = '''使用语音合成引擎VOCALOID3开发的女声虚拟歌姬，包含日本语、英语声源。原声提供者为Lia。
充满通透性口气清晰的高音域是其特色，在摇滚和节奏性舞曲较能表现其速度感，是使各式各样的声音成为可能的虚拟歌姬软件。
角色形象取名为イア(IA)，最初人设并没有对年龄、身高、体重、持有物(象征物)作出明确的设定。2018年1月27日，官方在《IA生诞6th&ONE生诞3th》（大概是这个名字）里公布了IA的身高为155公分。
代表物：羽毛（同人），樱花（官方）'''
vocaloid_singers['洛天依'] = '''洛天依（英：Luo Tianyi）是由上海禾念信息科技有限公司基于Yamaha研制的VOCALOID3开发的全世界第一款VOCALOID3中文声库虚拟偶像；
也属于VOCALOID CHINA“Vsinger”中的一员；声优为山新；鹿乃。日文声库完成制作，VOCALOID5已正式发售'''
singer = input('请输入要查找的虚拟歌姬：')
if singer in vocaloid_singers :
    print(vocaloid_singers[singer])
else :
    print('你的输入有误或暂时未收录')
    print('当前共收录'+str(len(vocaloid_singers))+"位歌姬：")
    for key in vocaloid_singers.keys():
        print(key)
